###############################################################################
# Created by write_sdc
# Mon Jan 16 01:39:30 2023
###############################################################################
current_design minimax_rf
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 60.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addrD[0]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addrD[1]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addrD[2]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addrD[3]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addrD[4]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addrS[0]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addrS[1]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addrS[2]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addrS[3]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addrS[4]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[0]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[10]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[11]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[12]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[13]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[14]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[15]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[16]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[17]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[18]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[19]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[1]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[20]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[21]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[22]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[23]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[24]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[25]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[26]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[27]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[28]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[29]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[2]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[30]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[31]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[3]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[4]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[5]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[6]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[7]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[8]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_value[9]}]
set_input_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {we}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[0]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[10]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[11]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[12]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[13]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[14]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[15]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[16]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[17]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[18]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[19]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[1]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[20]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[21]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[22]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[23]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[24]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[25]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[26]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[27]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[28]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[29]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[2]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[30]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[31]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[3]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[4]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[5]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[6]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[7]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[8]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rD[9]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[0]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[10]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[11]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[12]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[13]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[14]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[15]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[16]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[17]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[18]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[19]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[1]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[20]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[21]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[22]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[23]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[24]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[25]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[26]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[27]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[28]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[29]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[2]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[30]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[31]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[3]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[4]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[5]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[6]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[7]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[8]}]
set_output_delay 12.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rS[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {rD[31]}]
set_load -pin_load 0.0729 [get_ports {rD[30]}]
set_load -pin_load 0.0729 [get_ports {rD[29]}]
set_load -pin_load 0.0729 [get_ports {rD[28]}]
set_load -pin_load 0.0729 [get_ports {rD[27]}]
set_load -pin_load 0.0729 [get_ports {rD[26]}]
set_load -pin_load 0.0729 [get_ports {rD[25]}]
set_load -pin_load 0.0729 [get_ports {rD[24]}]
set_load -pin_load 0.0729 [get_ports {rD[23]}]
set_load -pin_load 0.0729 [get_ports {rD[22]}]
set_load -pin_load 0.0729 [get_ports {rD[21]}]
set_load -pin_load 0.0729 [get_ports {rD[20]}]
set_load -pin_load 0.0729 [get_ports {rD[19]}]
set_load -pin_load 0.0729 [get_ports {rD[18]}]
set_load -pin_load 0.0729 [get_ports {rD[17]}]
set_load -pin_load 0.0729 [get_ports {rD[16]}]
set_load -pin_load 0.0729 [get_ports {rD[15]}]
set_load -pin_load 0.0729 [get_ports {rD[14]}]
set_load -pin_load 0.0729 [get_ports {rD[13]}]
set_load -pin_load 0.0729 [get_ports {rD[12]}]
set_load -pin_load 0.0729 [get_ports {rD[11]}]
set_load -pin_load 0.0729 [get_ports {rD[10]}]
set_load -pin_load 0.0729 [get_ports {rD[9]}]
set_load -pin_load 0.0729 [get_ports {rD[8]}]
set_load -pin_load 0.0729 [get_ports {rD[7]}]
set_load -pin_load 0.0729 [get_ports {rD[6]}]
set_load -pin_load 0.0729 [get_ports {rD[5]}]
set_load -pin_load 0.0729 [get_ports {rD[4]}]
set_load -pin_load 0.0729 [get_ports {rD[3]}]
set_load -pin_load 0.0729 [get_ports {rD[2]}]
set_load -pin_load 0.0729 [get_ports {rD[1]}]
set_load -pin_load 0.0729 [get_ports {rD[0]}]
set_load -pin_load 0.0729 [get_ports {rS[31]}]
set_load -pin_load 0.0729 [get_ports {rS[30]}]
set_load -pin_load 0.0729 [get_ports {rS[29]}]
set_load -pin_load 0.0729 [get_ports {rS[28]}]
set_load -pin_load 0.0729 [get_ports {rS[27]}]
set_load -pin_load 0.0729 [get_ports {rS[26]}]
set_load -pin_load 0.0729 [get_ports {rS[25]}]
set_load -pin_load 0.0729 [get_ports {rS[24]}]
set_load -pin_load 0.0729 [get_ports {rS[23]}]
set_load -pin_load 0.0729 [get_ports {rS[22]}]
set_load -pin_load 0.0729 [get_ports {rS[21]}]
set_load -pin_load 0.0729 [get_ports {rS[20]}]
set_load -pin_load 0.0729 [get_ports {rS[19]}]
set_load -pin_load 0.0729 [get_ports {rS[18]}]
set_load -pin_load 0.0729 [get_ports {rS[17]}]
set_load -pin_load 0.0729 [get_ports {rS[16]}]
set_load -pin_load 0.0729 [get_ports {rS[15]}]
set_load -pin_load 0.0729 [get_ports {rS[14]}]
set_load -pin_load 0.0729 [get_ports {rS[13]}]
set_load -pin_load 0.0729 [get_ports {rS[12]}]
set_load -pin_load 0.0729 [get_ports {rS[11]}]
set_load -pin_load 0.0729 [get_ports {rS[10]}]
set_load -pin_load 0.0729 [get_ports {rS[9]}]
set_load -pin_load 0.0729 [get_ports {rS[8]}]
set_load -pin_load 0.0729 [get_ports {rS[7]}]
set_load -pin_load 0.0729 [get_ports {rS[6]}]
set_load -pin_load 0.0729 [get_ports {rS[5]}]
set_load -pin_load 0.0729 [get_ports {rS[4]}]
set_load -pin_load 0.0729 [get_ports {rS[3]}]
set_load -pin_load 0.0729 [get_ports {rS[2]}]
set_load -pin_load 0.0729 [get_ports {rS[1]}]
set_load -pin_load 0.0729 [get_ports {rS[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {we}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addrD[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addrD[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addrD[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addrD[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addrD[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addrS[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addrS[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addrS[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addrS[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addrS[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_value[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
